app/controllers/admin_controller.rb

  def login
    if request.post?
      session[:language] = params[:language]
      user = User.authenticate(params[:name], params[:password])
        if user
          session[:user_id] = user.id
          record = LoginDetail.new(:user => session[:user_id],:login =>Time.now.strftime("%Y/%m/%d"),:login_time =>Time.now.strftime("%I:%M:%S"))
          record.save
---
INSERT INTO "login_details" ("created_at", "login", "login_time", "logout", "logout_time", "updated_at", "user") VALUES ('2014-09-11 12:31:22.251695', '2014-09-11', '2000-01-01 06:01:22.000000', NULL, NULL, '2014-09-11 12:31:22.251695', 1) RETURNING "id"

  def logout
    log = LoginDetail.find(:last)
    if log != nil
      log.logout = Time.now.strftime("%Y/%m/%d")
      log.logout_time = Time.now.strftime("%I:%M:%S")
      log.save
---
UPDATE "login_details" SET "logout" = '2014-09-11', "logout_time" = '2000-01-01 06:01:28.000000', "updated_at" = '2014-09-11 12:31:28.021623' WHERE ("login_details"."id" = 1)